Repository: iisihe/YAAS-application
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: English
fi: Englanti

source: Finnish
fi: Suomi

source: Date format: dd.mm.yyy hh:mm
fi: Päivämäärä muodossa pp.kk.vvvv tt:mm

source: Required.
fi: Pakollinen.

source: No auctions
fi: Ei huutokauppoja.

source: Description:
fi: Kuvaus:

source: Minimum price:
fi: Lähtöhinta:

source: Deadline:
fi: Huutokauppa sulkeutuu:

source: Seller:
fi: Myyjä:

source: State:
fi: Tila:

source: Highest bid:
fi: Korkein tarjous :

source: Bid auction
fi: Tee tarjous

source: Auctions
fi: Huutokaupat

source: Add a new auction
fi: Lisää uusi huutokauppa

source: Your auctions
fi: Huutokauppakohteesi

source: Hello
fi: Hei

source: Logout
fi: Kirjaudu ulos

source: Edit your profile and change language
fi: Muokkaa profiiliasi ja vaihda kieltä

source: Emailhistory
fi: Sähköpostihistoria

source: Manage all auctions
fi: Hallitse huutokauppoja

source: You are not logged in. Password: asd123qw
fi: Et ole kirjautuneena sisään.

source: Login
fi: Kirjaudu sisään

source: Registration
fi: Rekisteröidy

source: Change language
fi: Vaihda kieltä

source: New auction has been saved
fi: Uusi huutokauppa on tallennettu.

source: Auction cancelled
fi: Huutokauppa peruutettu.

source: Invalid auction id
fi: Virheellinen huutokaupan id.

source: Auction updated
fi: Huutokauppa lisätty

source: Successfully registrated!
fi: Rekisteröityminen onnistui!

source: Check the values in the form.
fi: Tarkista lomakkeen arvot.

source: Your password was successfully updated!
fi: Salasanasi on nyt päivitetty.

source: The password was not suitable
fi: Salasana ei ole sopiva

source: Your profile is successfully updated!
fi: Profiilisi on nyt päivitetty.

source: Could not save the changes
fi: Muutoksia ei voitu tallentaa.

source: You cannot make a bid because you already have the highest bid.
fi: Et voi tehdä tarjousta, koska sinulla on jo korkein tarjous.

source: You cannot make a bid to your own auction.
fi: Et voi tarjota omaan huutokauppasi.

source: This auction is not active.
fi: Tämä huutokauppa ei ole enää aktiivinen
